Repository: sapatekno/flutter_boilerplate
Catalog: lib/lang/app_*.arb
Languages: id

source: username
id: nama pengguna

source: password
id: kata sandi

# createAccount
source: create an account
id: buat akun

source: information
id: informasi

# failNoInternet
source: unable to connect to the internet, check your network connection
id: tidak dapat terhubung ke internet, periksa koneksi jaringan anda

source: ok
id: oke

source: no data
id: tidak ada data

source: retry
id: ulangi

source: substation survey
id: survei gardu

source: customer survey
id: survei pelanggan

source: customer ID
id: ID pelanggan

# findCustomerId
source: find the customer ID
id: cari ID pelanggan

source: name
id: nama

source: rates
id: tarif

source: power
id: daya

source: address
id: alamat

source: substation number
id: nomor gardu

# findSubstationNumber
source: find the substation number
id: cari nomor gardu

source: accuracy
id: akurasi

source: save
id: simpan

source: update location
id: perbarui lokasi

# logoutConfirmation
source: are you sure want to logout?
id: apakah anda yakin ingin logout?

source: yes
id: ya

source: no
id: tidak

# failNoLocationService
source: location service on this device is not active, please enable it first
id: lokasi layanan di perangkat ini tidak aktif, harap aktifkan terlebih dahulu

# openApplicationSettings
source: open aplication settings
id: buka pengaturan aplikasi

source: open location settings
id: buka pengaturan lokasi

# failLocationpermissionDeniedForever
source: location access permission is denied forever, please change access in app settings
id: izin akses lokasi ditolak selamanya, harap ubah akses di pengaturan aplikasi

# failLocationpermissionDenied
source: location access permission denied, app needs location access to continue the process
id: izin akses lokasi ditolak, aplikasi memerlukan akses lokasi untuk melanjutkan proses

source: loading...
id: memuat...

source: substation type
id: tipe gardu

source: description
id: deskripsi

source: number of trafo
id: jumlah trafo

source: trafo data
id: data trafo

source: add
id: tambah

source: trafo number
id: nomor trafo

source: trafo capacity
id: kapasitas trafo

source: number of channels
id: jumlah saluran

# deleteConfirmation
source: are you sure you want to delete data?
id: anda yakin ingin menghapus data?

# saveConfirmation
source: are you sure you want to save data?
id: anda yakin ingin menyimpan data?

# dataEmptyMessage
source: data is still empty
id: data masih kosong

# dataCannotEmptyMessage
source: data cannot be empty
id: data tidak boleh kosong

# unknownError
source: an unknown error occurred
id: terjadi kesalahan yang tidak diketahui

# unauthorizedMessage
source: sorry your session has ended, please login again
id: maaf sesi anda telah berakhir, silahkan login kembali

# resetConfirmationMessage
source: all data changes will not be saved, are you sure?
id: semua perubahan data tidak akan disimpan, apakah Anda yakin?

# takePhoto
source: take a photo
id: ambil foto

source: change photo
id: ganti photo

# surveyMustAttachPhotoMessage
source: the survey must attach a photo
id: survei harus melampirkan foto

# taggingDataCannotEmptyMessage
source: tagging data cannot be empty
id: data tagging tidak boleh kosong

source: substation
id: gardu

source: customer
id: pelanggan

source: meter brand
id: merek meter

source: meter number
id: nomer meter

source: final stand
id: stand akhir

# rstMustSelected
source: the RST field has not been selected
id: bidang RST belum dipilih

# srMustSelected
source: the SR field has not been selected
id: bidang SR belum dipilih
